{"hed":"Hed","dek":"Subhed","author":"Jordan Dworkin","authorURL1":"https://twitter.com/jddwor","intro":[{"type":"text","value":"Arms spread and a smile on his face, Elon Musk welcomed the crowd to the <a href=https://www.theverge.com/2017/11/17/16669142/tesla-semi-roadster-2017-supercut-watch target = _blank>Tesla semi truck unveiling</a>. “I hope you like what you see,” he said, to cheers from the audience. Though innovations like Tesla’s promise increased <a href=https://techcrunch.com/2017/11/16/this-is-teslas-big-new-all-electric-truck-the-tesla-semi/ target=_blank>safety and efficiency</a> for the industries they inhabit, these advances in automation and AI promise <a href=https://www.wired.com/story/what-does-teslas-truck-mean-for-truckers/ target=_blank>uncertainty</a>, and potential displacement, for the workers in their way."},{"type":"text","value":"While many are calling for the <a href=https://qz.com/1089261/americans-want-big-government-help-when-robots-and-artificial-intelligence-take-their-jobs/ target=_blank>government</a> to step in, in this piece we are going to focus on the workers themselves. Specifically, we want to ask how workers should train and be trained to most effectively switch jobs. In this context, discussions often focus on the somewhat drastic example of switching from blue-collar work to computer programming. While there are organizations doing great work to facilitate this switch, we wanted to use this example to ask: Is it necessary for workers to move that far across the job landscape to avoid automation?"}],"twojobs":[{"id":"0","step":"all-automation","text":"To better understand the potential effects of automation, <a href=https://www.oxfordmartin.ox.ac.uk/downloads/academic/The_Future_of_Employment.pdf target=_blank> a recent study</a> by Carl Frey and Michael Osborne estimated the “automatability” of hundreds of different jobs. Jobs with a high social component and a high number of non-routine tasks, like <span class=heavy-prose-blue-text>elementary school teachers</span>, are unlikely to become automated. Jobs with many monotonous tasks and a low requirement for complex social skills, like <span class=heavy-prose-red-text>telemarketers</span>, are likely to be replaced by machines."},{"id":"1","step":"main-job-circle","text":"There are nearly 2 million heavy truck drivers in the U.S. For many years, it’s allowed people without a college education to maintain a dependable, middle-class income. According to Frey and Osborne, the likelihood that <span class=heavy-prose-red-text>heavy truck drivers</span> will become automated is 79%. If jobs in trucking are scaled back or replaced, many of the <span class=heavy-prose>2 million</span> will lose a stable and secure pathway to the middle class."},{"id":"2","step":"main-job-automation","text":"For people whose jobs are at risk, the transition to <span class=heavy-prose-blue-text>software development</span> makes ostensible sense: it’s a job that’s highly unlikely to become automated, and affords a good income."},{"id":"3","step":"images-two-jobs-two-skills-developers","text":"By surveying workers on the importance of various skills and knowledge areas to their job, the Department of Labor provides a way to understand the components of each job. As expected, it is crucial that software developers excel at programming — a skill that’s largely irrelevant to truckers."},{"id":"4","step":"images-two-jobs-all-skills","text":"Here are some of the skills by which the Department of Labor describes all jobs. Unsurprisingly, truckers and developers have relatively few similarities in terms of the competencies necessary for their respective jobs."},{"id":"5","step":"images-two-jobs-highlight-skill-differences","text":"By looking at the differences between software developers and truck drivers across this range of skills, we can tell how far their expertise diverge."},{"id":"6","step":"images-two-jobs-stacked-skills","text":"We can place other careers on a line, from least similar to most similar in skill to truck drivers. When comparing the skills among these professions, <span class=heavy-prose-red-text>pipelayers</span> are most similar to truck drivers, while <span class=heavy-prose-blue-text>CEOs</span> are most different. Ideally, truck drivers would transition to jobs that are similar in skills, but that are less automatable."}],"scatter":[{"id":"7","step":"x-axis-base","text":"We can place every single career listed by the Department of Labor on the horizontal axis, from least similar in skill to most similar. Of nearly 700 jobs, psychologists are most distinct from truck drivers, while septic tank servicers and sewer pipe cleaners have the greatest skills overlap."},{"id":"8","step":"xy-axis-scatter","text":"Some career alternatives based on skills alone, like becoming a sailor, may first seem viable, but are, in fact, more susceptible to automation than truckers. Ideally, we would help truck drivers transition to jobs that are similar in skills, but that are less automatable, so let’s remove every job that’s at greater risk of automation."},{"id":"9","step":"xy-axes-scatter","text":"We’re most interested in the top right corner: those are the jobs with low automatability and similar skills to truckers. In this case, ambulance driving, which is unlikely to be automated, seem like a viable alternative. We should also, however, consider the salaries that these professions will earn as well. Truck drivers earn around <span class=heavy-prose>$44,000</span> a year, so an alternative job should have a similar income."},{"id":"10","step":"xy-axes-scatter-filtered","text":"Many alternative jobs for truckers, including ambulance drivers, have a much lower income.  Yet ship engineers bring in a similar income, have closely related skills, and are less at risk of automation than truck drivers. We should, however, consider one final job characteristic: the number of these jobs that will likely be available in 10 years. If there are nearly 2 million truckers in America today, which occupations will have a big enough market for the large number of truck drivers to comfortably make the transition?"},{"id":"11","step":"show-similarity-auto-wage","text":"When we add job availability, corresponding to circle size, into this equation, there are even fewer jobs to consider. Yet a few good options appear that offer an easier transition than software development. Two examples are electricians and supervisors of extraction/construction workers. These jobs have similar levels of employment and offer modest income increases, while being much safer from automation than truck driving."},{"id":"12","step":"show-similarity-auto-wage-number","text":"Curious about transitioning from another career? <span class=heavy-prose>Select a different job in the menu above!</span>"}],"conclusion":[{"id":"13","step":"conclusion","text":"Future-proof white-collar jobs are, doubtless, an appealing set of options for solving the potential automation crisis. They are, nevertheless, <a href=https://www.mdrc.org/sites/default/files/WorkAdvance_Brief.pdf target=_blank>difficult to implement</a> among workers who lack the necessary technical background — not everyone has the knowledge base to become, say, a successful developer or mathematician, with the resources they have at hand. As tempting as it may be to shepherd everyone towards tech-heavy careers, we ought to be more thoughtful with our proposed solutions. After all, millions of people’s futures depend on it."}],"methodology":[{"id":"14","step":"methodology","text":"<span class=heavy-prose>Methodology and Data Sources</span> Data on the automatability of different jobs came from Frey and Osborne's 2013 <a href=http://www.oxfordmartin.ox.ac.uk/downloads/academic/The_Future_of_Employment.pdf target=_blank>study</a>, in which they used a machine learning algorithm to classify automation likelihoods based on the individual tasks that comprised each job. Data on the average annual wage and employment projections for each job came from the Bureau of Labor Statistics’ <a href=https://data.bls.gov/projections/occupationProj target=_blank>2016 report</a>. Data on the importance of individual <a href=https://www.onetcenter.org/dictionary/22.3/excel/skills.html target=_blank>skills</a> and <a href=https://www.onetcenter.org/dictionary/22.3/excel/knowledge.html target=_blank> knowledge areas</a> to each job were provided by O*Net. Job similarities were computed using a Euclidean-distance based similarity score applied to the jobs’ importance values for each skill and knowledge area."}]}